Repository: 84000/data-translation-memory
Catalog: toh186-v2.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Omniscient One!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཆུ་བོ་ཆེན་པོ་ཀླུང་ནཻ་རཉྫ་ནཱའི་འགྲམ་ན། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ལག་ན་རྡོ་རྗེ་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བདུན་སྟོང་དང་། རབ་འབྱོར་དང་། ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་ཐམས་ཅད་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: The Blessed One was dwelling on the banks of the great Nairañjanā River, together with seven thousand bodhisattvas. Among them were the Noble Avalokiteśvara, Vajrapāṇi, Maitreya, and Mañjuśrī, and all the great śrāvakas like Subhūti, Śāriputra, and Maudgalyāyana.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་ཐམས་ཅད་ཀྱིས་བསྐོར་ཅིང་། མདུན་དུ་བདར་ཏེ
en: He was circumambulated by Śakra, Brahmā, and all the protectors of the world, as well as all the kings, ministers, brahmins, and householders, and was placed in front of the assembly.

source: ཞལ་ཟས་ཀྱི་བྱ་བ་བྱས་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དག་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཚིམ་པར་བྱས། བསྐུལ། གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས་ཏེ།
en: After being presented with offerings of almsfood, he pleased his surrounding retinue with a teaching on Dharma, and encouraged, uplifted, and complimented them.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་དང་། ཐབས་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ཆེན་པོས་གྲོང་ཁྱེར་གཱ་རཱ་ཎ་སཱིའི་གཤེགས་ཏེ།
en: By means of his great supernatural power, the Tathāgata and his surrounding retinue were then transported to the city of Vārāṇasī,

source: བཱ་རཱ་ཎ་སཱིའི་ཤིང་ཨ་མྲ་སྲུང་བའི་ཚལ་ན་བཞུགས་སོ། །
en: where they stayed in the grove of the caretaker of mango trees.

source: དེ་ནས་དེའི་ཚེ་ན་ས་ཆེར་གཡོས་པར་གྱུར་ནས་
en: At that time the earth trembled greatly, and

source: སེང་གེའི་ཁྲི་ཆེན་པོ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ། འཕང་དུ་དཔག་ཚད་གཅིག་ཙམ། ཞེང་དུ་དཔག་ཚད་ཕྱེད་ཙམ་གྱི་ཚད་ལེགས་པར་སྤྲས་པ། ཤིན་ཏུ་དགའ་བར་འགྱུར་བ། ཡིད་དུ་འོང་བ་དར་གྱི་ཆུན་པོ་བཏགས་ཤིང་དཔྱངས་པ། ལྷའི་ན་བཟའ་བརྒྱ་སྟོང་དུ་མ་བཏིང་བ། ལྷའི་མེ་ཏོག་གི་ཆུན་པོ་བྱེ་བ་དུ་མ་རབ་ཏུ་དཔྱངས་པ། ལྷའི་དྲི་དང་ལྡན་པ། ཁ་དོག་དང་ལྡན་པ།
en: a vast lion throne made from the seven kinds of precious substances appeared. Covering about ten miles in height and five miles in breadth, it was well adorned, delightful, and pleasing to the mind. It was tied with hanging silk tassels, clothed with thousands of divine garments, covered with myriad garlands of divine flowers, endowed with a divine fragrance, and colorful.

source: དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་ལས་སྐྱེས་པ། དེ་མཐོང་མ་ཐག་ཏུ་སེམས་ཅན་ཐམས་ཅད་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་བ་ཞིག་བྱུང་ངོ་། །
en: The lion throne had arisen from the Tathāgata’s previously developed roots of virtue. As soon as they saw it, all beings would immediately reach the stage of accepting that phenomena are not produced.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སེང་གེའི་ཁྲི་དེ་ཉིད་ལ་བཞུགས་ཏེ་
en: Then, the Blessed One sat down on this lion throne,

source: སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་
en: settled into the state of concentration known as the garlands of the buddhas, and

source: བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ།
en: addressed the bodhisattvas Noble Avalokiteśvara and Vajrapāṇi as follows.

source: སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཁྱོད་སོང་ལ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན། ཁྱོད་ཀྱིས་འདུལ་བར་འགྱུར་བའི་སེམས་ཅན་སྙིགས་མའི་རང་བཞིན་ཅན་མ་དད་པ། སྡིག་པ་སྤྱོད་པ། ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དག་གིས་བསྒྲིབས་པ། མར་མི་ཤེས་པ། ཕར་མི་ཤེས་པ། དགེ་སྦྱོང་ལ་དགེ་སྦྱོང་དུ་མི་འཛིན་པ། བྲམ་ཟེར་མི་འཛིན་པ། དཀོན་མཆོག་གསུམ་ལ་མངོན་པར་མ་དད་པ། དེ་དག་ཐམས་ཅད་ལག་ན་རྡོ་རྗེ་དང་། གཉིས་ཀྱིས་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས་འཁོར་གྱི་དཀྱིལ་འཁོར་འདིར་བསྡུས་ཤིག །
en: “Avalokiteśvara, go forth. Together with Vajrapāṇi, use your great supernatural powers and state of concentration to assemble around me the beings of this Sahā world system and of the other world systems of the ten directions whom you should tame and who are degenerate, have no faith, practice negative deeds, are obscured because of various types of affliction, have no consideration for their mothers or fathers, do not respect ascetics or brahmins for what they are, and have no faith in the Three Jewels.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་དེ་བཞིན་གཤེགས་པ་ལས་ཚིག་འདི་ཐོས་ན
en: On hearing these words from the Tathāgata, the bodhisattvas Noble Avalokiteśvara and Vajrapāṇi

source: སེམས་ཅན་ཐམས་ཅད་ལ་བལྟ་བ་དང་། ཡང་དག་པར་སྐུལ་བར་འགྱུར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: settled into the state of concentration known as watching over and exhorting all beings.

source: ཏིང་ངེ་འཛིན་དེའི་མཐུས་ས་ཆེན་པོ་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས། རབ་ཏུ་གཡོས། ཡང་དག་པར་རབ་ཏུ་གཡོས་སོ། །
en: Through the ­power of their state of concentration, this great earth was tremendously shaken in six ways.

source: དེ་ནས་ལུས་ལས་འོད་ཟེར་བརྒྱ་སྟོང་དུ་མ་བྱུང་ངོ་། །
en: Thousands of light rays shone forth from the bodies of Avalokiteśvara and Vajrapāṇi,

source: བྱུང་ནས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཀུན་ཏུ་སྣང་བར་བྱས་ཏེ།
en: and as they shone they completely illuminated the world systems of the great trichiliocosm.

source: ཚངས་པའི་འཇིག་རྟེན་མན་ཆད་གཟུགས་ཡོད་པ་དང་། གཟུགས་ཀྱིས་ཁྱབ་པ་མན་ཆད་དུ་སྣང་བར་བྱས་ཏེ།
en: They illuminated everything from the world of Brahmā on down—that is, the worlds endowed with form and pervaded by form.

source: འོད་ཟེར་དེ་དག་ལས་ཀྱང་ཡང་དག་པར་སྐུལ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་། །
en: From these light rays also came these verses of exhortation:

source: བག་ཡོད་པ་དང་ཉོན་མོངས་མེད་པར་བྱོས། །
en: “Be attentive and without afflictions.

source: བག་མེད་པ་ཡི་དབང་དུ་མ་འགྲོ་ཞིག །
en: Do not fall under the power of distraction!

source: སྐྱེ་དང་རྒ་ཤིས་གཙེས་པའི་སྡུག་བསྔལ་ཏེ། །
en: While everywhere is the suffering of birth, old age, and death,

source: བདེ་བར་གཤེགས་པའི་བསྟན་པ་འབྱུང་བར་དཀོན། །
en: Rare is the appearance of the teaching of the Sugata.

source: བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་གྲངས་མེད་དུ། །སྲིད་པའི་རྒྱ་མཚོར་ངེས་པར་འཁོར་བ་དང་། །ཉོན་མོངས་དོག་པར་རྟག་ཏུ་འཁོར་བ་ན། །
en: Even though they are bound to circle In saṃsāra’s ocean for countless eons, Always ensnared by afflictions.

source: འཚོ་བ་མ་རུངས་པ་ནི་སྐྲག་མི་འགྱུར། །
en: “Those of unwholesome livelihood have no fear,

source: རྙེད་དང་ཆགས་དང་བུད་མེད་རྟག་པ་མིན། །
en: “Gain, desires, and women are impermanent.

source: རྟག་ཏུ་གླུ་གར་སྒྱུ་མའི་ཆོས་དང་ལྡན། །
en: They always possess the nature of an illusory song and dance.

source: བསྐལ་པ་དུ་མར་བདེ་བ་མྱོང་ནས་ཀྱང་། །ཕྱིས་ནི་སྡུག་བསྔལ་རྗེས་སུ་ཐོབ་པར་འགྱུར། །
en: Even if one experiences eons of bliss, One will eventually undergo suffering.

source: རྣམ་པར་སླུ་བར་གྱུར་པ་འདི་ལ་ལྟོས། །
en: “Behold how tricky things are!

source: འདི་ལ་མར་གྱུར་པ་ཡང་ཆུང་མར་འགྱུར། །
en: One’s mother in this life may be one’s wife in another,

source: དེ་ཡི་ཤ་དག་ཡོངས་སུ་ཟོས་ནས་ཀྱང་། །མི་མཁས་པ་དག་མི་ཤེས་དགའ་བར་འཛིན། །
en: And in yet another life fools may eat her flesh, And in their ignorance enjoy it.

source: སྲིད་པའི་སྡུག་བསྔལ་རྒྱ་མཚོར་སྐྱེ་བ་དེ། །མིས་ནི་མ་མྱོང་མེད་ལ་སྐྲག་པ་མེད། །
en: “No doubt, human beings take birth in the ocean of saṃsāra’s suffering, Yet they are not afraid.

source: མི་རྣམས་ཀྱི་ནི་དམ་པའི་ཆོས་འཆད་ཀྱིས། །བདེ་བར་གཤེགས་ལ་མཆོད་པར་འདོད་རྣམས་དེང་། །
en: You who desire to honor the Sugata for having explained the noble Dharma to human beings, Go forth!

source: མི་འདུལ་ཁ་ལོ་སྒྱུར་བ་དེ་མཐོང་ནས། །
en: “Once you have understood the one who can guide the untamed,

source: ཏིང་འཛིན་ཞི་བ་བསྒོམ་པ་ཐོབ་འགྱུར་གྱི། །
en: You will attain the state of concentration, the cultivation of peace.

source: དེ་ཕྱིར་སྡུག་བསྔལ་རྒྱ་མཚོར་མི་གང་རྣམས། །སྐྲག་པར་གྱིས་ལ་ཐར་པ་འདོད་པར་བྱོས། །
en: Thus, all you human beings in the ocean of saṃsāra, Be afraid and long for liberation!

source: མི་རྣམས་ཀྱིས་ནི་དམ་པ་དེ་ལ་མཆོད། །
en: “All you humans, honor this noble one!

source: གཞན་གྱི་སྲོག་ནི་མ་གཅོད་དེ་བཞིན་དུ། །གཞན་གྱི་ནོར་དག་མ་བྱིན་ལེན་མ་བྱེད། །
en: Do not take the lives of others, And likewise do not take others’ possessions that have not been offered.

source: གཞན་གྱི་བུད་མེད་དག་ལ་འཚེ་མ་བྱེད། །
en: Do not violate other people’s wives.

source: སངས་རྒྱས་ཆོས་ལ་རྟག་ཏུ་གུས་པར་བྱོས། །
en: “Always pay homage to the Buddhadharma!

source: ང་རྒྱལ་རྒྱགས་དང་བརླང་བ་སྤངས་ནས་ཀྱང་། །
en: Give up pride, arrogance, and harsh speech,

source: བཱ་རཱ་ཎ་སཱི་ཞེས་ནི་བྱ་བ་ཡི། །ཨ་མྲ་སྲུང་བ་མོ་ཡི་ཚལ་དུ་དེང་། །
en: And then set out for the grove of the caretaker of mango trees In the city called Vārāṇasī!

source: མི་མཆོག་ལ་ནི་མྱུར་དུ་བལྟ་བར་གྱིས། །
en: “Upon arriving, behold the supreme person.

source: དེ་ཡི་བཀོད་པ་རྒྱ་ཆེར་ཡིད་དུ་འོང་། །
en: Vast and pleasing is his array:

source: དགེ་སློང་དགེ་འདུན་རྟག་ཏུ་རྫུ་འཕྲུལ་ལྡན། །
en: The saṅgha of monks who always have supernatural powers,

source: བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་ཆེན་རྫུ་འཕྲུལ་ཆེ། །
en: And the bodhisattvas who possess even greater ones.

source: སེམས་ཅན་མི་མཁས་ཁོང་དུ་ཆུད་བྱ་དང་། །སེམས་ཅན་བྱེ་བ་མང་པོ་ཐར་བྱའི་ཕྱིར། །འོད་ཟེར་རྟག་ཏུ་གང་གིས་བཏང་བ་དེ། །མཚན་ནི་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གོ། །
en: “He is named Avalokiteśvara Who continuously sends forth light rays So that the ignorant know And the myriad beings are liberated.

source: གང་དག་ང་རྒྱལ་རྒྱགས་ཁེངས་བགྱིད་གྱུར་ཅིང་། །སངས་རྒྱས་ཆོས་ལ་རིམ་གྲོ་མི་བྱེད་པ། །ལག་ན་རྡོ་རྗེ་མགོན་པོ་སེམས་ཅན་མཆོག །རྟག་ཏུ་འོད་ཟེར་གཏོང་ཞིང་གོ་བར་བྱེད། །
en: “Those who are proud, arrogant, and haughty, And those who do not venerate the Buddhadharma, The protector, the supreme Vajrapāṇi, never ceases to illuminate them And leads them to understanding.

source: དེ་ཡི་གཟུགས་ནི་ཡངས་ཤིང་རྫུ་འཕྲུལ་ཆེ། །
en: “Their bodies are vast with great supernatural powers.

source: བསྐལ་པ་བྱེ་བར་དེ་ནི་བཤད་མི་རྫོགས། །
en: Eons and eons would not suffice to describe them.

source: འདིར་ནི་བདེ་བར་གཤེགས་ལ་མཆོད་པའི་ཕྱིར། །དྲི་དང་ཕྲེང་བ་གོས་མཆོག་རྒྱན་ཁྱེར་ལ། །
en: “There, in the grove of the caretaker of mango trees, Bring perfume, garlands, fine clothes, and ornaments to honor the Sugata.

source: མི་ཡི་འདྲེན་པ་འདི་ལ་མཆོད་པར་བྱོས། །
en: Venerate this guide of humankind,

source: སངས་རྒྱས་འབྱུང་བར་འགྱུར་བ་རབ་དཀོན་ནོ། །
en: For rare is a buddha.

source: འདོད་ཕྱིར་བསྐལ་པ་བྱེ་བ་མང་པོར་ཡང་། །རྟག་ཏུ་སྡུག་བསྔལ་ཐོབ་ཅིང་འཐོབ་པར་འགྱུར། །
en: “Beings have suffered for myriads of eons And will forever do so due to desire.

source: མཁས་པས་རྟག་ཏུ་ཐར་པ་འདོད་པར་གྱིས། །མི་མཆོག་སངས་རྒྱས་ལ་ནི་མཆོད་པར་བྱོས། །
en: May the wise always long for liberation And venerate the supreme person, the Buddha!

source: བུ་དང་བུ་མོ་དེ་བཞིན་གཉེན་རྣམས་དང་། །ཕ་མ་ཆུང་མ་བཤེས་མང་སྐྱེ་བོ་རྣམས། །ཐམས་ཅད་སྒྱུ་མ་འདྲ་བས་དོན་མེད་དེ། །
en: “Sons, daughters, relatives, Parents, wives, friends— All are illusory and pointless;

source: རྟག་པར་གཞན་དང་གཞན་དུ་སྐྱེ་བར་འགྱུར། །
en: They will always be reborn in different ways.

source: དེ་ལྟར་གསེར་དང་དངུལ་ཡང་གློག་དང་འདྲ། །
en: “So, too, gold and silver are like flashes of lightning.

source: འདི་ལ་སྙིང་པོ་འགའ་ཡང་སྣང་བ་མེད། །
en: None show any essence.

source: བྱང་ཆུབ་གོ་འཕང་ཐོབ་པར་བྱ་བའི་ཕྱིར། །མི་རྣམས་འདྲེན་པ་ལ་ནི་མཆོད་པར་བྱོས། །
en: To reach the state of awakening, Venerate the guide of humankind."

source: དེ་ནས་དེའི་ཚེ་ན་འོད་ཟེར་ལས་བྱུང་བའི་ཚིགས་སུ་བཅད་པས་བསྐུལ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་འདིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྒྲས་གང་བར་གྱུར་ནས་
en: As these inspirational verses arose one after another from the light rays, they filled the world systems of the great trichiliocosm with sound,

source: སེམས་ཅན་ཐམས་ཅད་ལ་བསྐུལ་བར་གྱུར་ཏེ
en: inspiring all beings.

source: སེམས་ཅན་གང་དག་ལོག་པར་ལྟ་བ་དེ་དག་ནི་ཡང་དག་པའི་ལྟ་བ་ལ་བཀོད་པར་གྱུར།
en: Those who formerly had wrong views were converted to right views.

source: གང་དག་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། ཁེངས་པ་དང་། འགྱིང་བ་དེ་དག་ནི་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། ཁེངས་པ་རྣམས་དང་བྲལ་བར་བྱེད་པར་འགྱུར།
en: Those who were afflicted with pride, vanity, arrogance, and pretense were freed from pride, vanity, and arrogance.

source: གང་དག་འདོད་ཆགས་ལ་རྗེས་སུ་སྤྱོད་ཅིང་བག་མེད་པར་གྱུར་པ། དེ་དག་ནི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར།
en: Those who indulged in lust without restraint were freed from lust.

source: གང་དག་སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། མི་དགེ་བའི་ཆོས་བརྒྱད་ལ་གནས་པ་དེ་དག་ཐམས་ཅད་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་སྤྱོད་པ་རྣམས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གནས་པར་གྱུར།
en: All those who engaged in killing, stealing, sexual misconduct on account of desire, or the eight unwholesome factors, were set on the noble eightfold path in all their actions, words, and thoughts.

source: ཐམས་ཅད་ཀྱང་རྒོད་པ་དང་། ཀུ་རེ་དང་། དགའ་བ་དང་། རྩེ་བ་དང་། འདོད་པ་དང་། ཁྲོ་བ་དང་། ཕྲག་དོག་དང་། ཆགས་པ་ཡོངས་སུ་སྤངས་ནས་
en: Each and every one of them completely abandoned excitement, joking, pleasure, amusement, desire, anger, envy, and attachment.

source: དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ་དང་། བསྟེན་པ་དང་། བསྙེན་བཀུར་བྱ་བ་ལ་སྤྲོ་བར་གྱུར།
en: They felt determined to contemplate, follow, and serve the Tathāgata.

source: ཐམས་ཅད་ཀྱང་ཆོས་ཉན་པར་འདོད་པར་གྱུར་ཏོ། །
en: They all wished to hear the Dharma.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། ཀླུའི་རྒྱལ་པོ་དང་། རྒྱལ་པོ་མཁར་གྱི་བདག་པོ་དང་། རྒྱལ་ཕྲན་དང་། སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ཕྱིར་ལྷའི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། སིལ་སྙན་དང་། དར་གྱི་ཆུན་པོ་རྣམས་ཐོགས་ཏེ་
en: All the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, non-humans, kings of the nāgas, royal lords of the citadels, vassals, universal monarchs, monks, nuns, male lay vow holders, and female lay vow holders carried divine flowers, garlands, salves, aromatic powders, garments, umbrellas, royal banners, cymbals, and bundles of silk scarves in order to venerate the Tathāgata.

source: གྲོང་ཁྱེར་ཆེན་པོ་བཱ་རཱ་ཎ་སཱི་ཞེས་བྱ་བ་གང་ན་བ་དང་། ཨ་མྲ་སྲུང་བ་མོའི་ཚལ་གང་ན་བ་དེར་དོང་ནས་
en: Once they reached the place where he resided, the grove of the caretaker of mango trees in the great city of Vārāṇasī,

source: བདག་གི་བསོད་ནམས་ལས་སྐྱེས་པའི་དགེ་བའི་རྩ་བས་དེ་བཞིན་གཤེགས་པ་དང་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམས་ལ་མངོན་པར་མཆོད་དེ
en: they worshipped him and his surrounding retinue with the roots of virtue that arose from their own merit.

source: མེ་ཏོག་གི་ཆར་དང་། དྲིའི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་བོ། །
en: A rain of flowers, a great fragrant rain, fell.

source: དེ་ནས་དེའི་ཚེ་ན་བཅོམ་ལྡན་འདས་འཛམ་བུའི་གླིང་དང་། ཨ་མྲ་སྲུང་བ་མོའི་ཚལ་དེ་དཔག་ཚད་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་སྲིད་དུ་རྒྱ་ཆེ་བར་བྱིན་གྱིས་བརླབས་ཏེ།
en: Then, at that moment, the Blessed One exerted his sovereign power on Jambudvīpa and the grove of the caretaker of mango trees so that it extended over several trillions of yojanas.

source: ས་གཞི་ལག་མཐིལ་ལྟར་མཉམ་ལ། ལྷའི་ཡིད་དུ་འོང་བ་ཁ་དོག་དང་ལྡན་པ།
en: The ground became as smooth as the palm of a hand, divinely pleasing to the mind, colorful, and fragrant.

source: དྲི་དང་ལྡན་པ། ལྷའི་མེ་ཏོག་གི་ཤིང་དང་། འབྲས་བུའི་ཤིང་དང་། སྤོས་ཀྱི་ཤིང་དང་། རིན་པོ་ཆེའི་ཤིང་དང་། དཔག་བསམ་གྱི་ཤིང་དང་། གོས་ཀྱི་ཤིང་རྣམས་ཀྱིས་མཛེས་པར་བྱས་པ།
en: It was ornamented with heavenly flower trees, fruit trees, fragrant trees, jewel trees, wish-fulfilling trees, and trees bearing garments.

source: ལྷའི་སེང་གེའི་ཁྲི་དང་ལྡན་པ། རིན་པོ་ཆེ་དང་། དར་དང་། མེ་ཏོག་གི་ཆུན་པོ་རབ་ཏུ་དཔྱངས་པ། ལྷའི་དྲིལ་བུའི་སྒྲས་བརྒྱན་པར་གྱུར་ཏེ
en: It supported heavenly lion thrones with hanging garlands of jewels, cloth, and flowers, and was suffused with the sound of divine bells.

source: འདི་ལྟ་སྟེ། དཔེར་ན་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་དུ་ཡིད་འཕྲོག་པར་བྱེད་པ། ཚིམ་པར་བྱེད་པ། མགུ་བར་བྱེད་པ། མངོན་པར་དགའ་བར་བྱེད་པ།
en: Thus, just like the world system known as Sukhāvatī, it was ravishing, fulfilling, pleasing, and delightful.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ནས་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱི་བར་དུ་དེ་དག་གིས་གང་བར་བྱིན་གྱིས་བརླབས་སོ། །
en: It was blessed, being filled by everyone, from bodhisattvas, śrāvakas, pratyekabuddhas, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, to monks, nuns, male and female lay vow holders, kings, ministers, brahmins, and householders.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་
en: Then, the bodhisattvas Noble Avalokiteśvara and Vajrapāṇi emerged from their state of concentration and

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: went to where the Blessed One was staying.

source: ཕྱིན་པ་དང་། ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ཏེ
en: They approached, circumambulated him three times, and

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: said to him,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐབས་མཁས་པ་དང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་ནི་མང་ངོ་། །
en: “Blessed One, the Tathāgata’s skillful means and methods that bring beings to spiritual maturity are many.

source: བདེ་བར་གཤེགས་པ་མང་ངོ་། །
en: Sugata, they are many indeed.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་གཟི་བརྗིད་དང་རྫུ་འཕྲུལ་གྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ཉན་ཐོས་ཆེན་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་མང་དུ་འདུས་སོ། །
en: Blessed One, the bodhisattva mahāsattvas, the great śrāvakas, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, kings, ministers, brahmins, householders, monks, nuns, and male and female lay vow holders have gathered here in great numbers through the strength of the Tathāgata’s majesty and supernatural powers.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: “Sons of a good family, this is excellent, most excellent.

source: ཀྱེ་རྒྱལ་བའི་བུ་དག་དེ་བཞིན་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཐབས་མཁས་པ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ནི་མང་ངོ་། །
en: Sons of the Victorious One, it is indeed so. Many are the Tathāgata’s skillful means and methods that bring beings to spiritual maturity.

source: སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བུ་དང་། ཇི་ལྟར་འདུལ་བ་དང་། དགེ་བའི་རྩ་བ་ཇི་ལྟ་བུ་དང་། སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་སྣ་ཚོགས་ཀྱི་སྤྱོད་པ་མཁྱེན་ནས་ཆོས་སྟོན་ཏེ།
en: He teaches the Dharma knowing their intentions, the way to convert them, and their roots of virtue, as well as their behavior according to their various dispositions.

source: སེམས་ཅན་ཁ་ཅིག་ནི་བྱང་ཆུབ་སེམས་དཔས་འདུལ།
en: Some beings are to be converted by bodhisattvas.

source: ཁ་ཅིག་ནི་ཉན་ཐོས་ཀྱིས་འདུལ།
en: Some are to be converted by śrāvakas.

source: ཁ་ཅིག་ནི་རང་སངས་རྒྱས་ཀྱིས་འདུལ།
en: Some are to be converted by pratyekabuddhas.

source: ཁ་ཅིག་ནི་ལྷས་འདུལ།
en: Some are to be converted by gods.

source: ཁ་ཅིག་ནི་བརྒྱ་བྱིན་གྱིས་འདུལ།
en: Some are to be converted by Śakra.

source: ཁ་ཅིག་ནི་ཚངས་པས་འདུལ།
en: Some are to be converted by Brahmā.

source: ཁ་ཅིག་ནི་ཀླུས་འདུལ།
en: Some are to be converted by nāgas.

source: ཁ་ཅིག་ནི་རྫུ་འཕྲུལ་ཆེན་པོས་འདུལ།
en: Some are to be converted by great supernatural powers.

source: ཁ་ཅིག་ནི་རྒྱལ་པོས་འདུལ།
en: Some are to be converted by kings.

source: ཁ་ཅིག་ནི་ཏིང་ངེ་འཛིན་གྱིས་འདུལ།
en: Some are to be converted by states of concentration.

source: ཁ་ཅིག་ནི་ཆོས་ཉན་པས་འདུལ།
en: Some are to be converted by listening to the Dharma.

source: ཁ་ཅིག་ནི་ཆོ་འཕྲུལ་གྱིས་འདུལ།
en: Some are to be converted by miracles.

source: ཁ་ཅིག་ནི་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདའ་བས་འདུལ།
en: Some are to be converted by the Tathāgata’s complete nirvāṇa.

source: ཁ་ཅིག་ནི་རིང་བསྲེལ་གྱིས་འདུལ།
en: Some are to be converted by relics.

source: ཁ་ཅིག་ནི་མཆོད་རྟེན་བྱེད་དུ་གཞུག་པ་དང་། གཙུག་ལག་ཁང་དང་། འཆག་ས་དང་། སྐྱེད་མོས་ཚལ་བྱེད་དུ་གཞུག་པའི་དགེ་བའི་རྩ་བ་ལ་སྤྲོ་བ་བསྐྱེད་པས་འདུལ།
en: Some to be converted strive for the roots of virtue that arise from commissioning stūpas, monasteries, promenades, and groves.

source: ཁ་ཅིག་ནི་སྐུ་གཟུགས་བྱེད་དུ་གཞུག་པ་དང་། རི་མོ་དང་། གསེར་དང་། དངུལ་དང་། ར་གན་གྱི་སྐུ་གཟུགས་བྱེད་དུ་གཞུག་པའི་དགེ་བའི་རྩ་བ་ལ་སྤྲོ་བ་བསྐྱེད་པས་འདུལ།
en: Some to be converted strive for the roots of virtue that arise from commissioning statues, images, and representations of gold, silver, and brass.

source: ཁ་ཅིག་ནི་དགེ་སློང་གི་དགེ་འདུན་ལ་མཆོད་པ་དང་བཀུར་སྟི་བྱ་བའི་དགེ་བའི་རྩ་བ་ལ་སྤྲོ་བ་བསྐྱེད་པས་འདུལ།
en: Some to be converted strive for the roots of virtue that arise from worshipping and venerating the saṅgha of monks.

source: ཁ་ཅིག་ནི་མདོ་སྡེ་འདྲི་བ་དང་། འདྲིར་གཞུག་པ་དང་། བཀླག་པ་ལ་སྤྲོ་བ་བསྐྱེད་པས་འདུལ།
en: Some to be converted strive for the roots of virtue that arise from copying sūtras, having sūtras copied, or reciting sūtras.

source: ཁ་ཅིག་ནི་མར་མེ་དང་། སྤོས་དང་། མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། དོ་ཤལ་ལ་སོགས་པས་བརྒྱན་པ་ལ་སྤྲོ་བ་བསྐྱེད་པས་འདུལ་བ་ཡིན་ཏེ
en: Some to be converted strive for the roots of virtue that arise from offering lamps, incense, flowers, perfume, garlands, salves, jewel necklaces, and so forth.

source: དོན་དམ་པ་ལ་མཁས་པའི་ཆོས་དང་ལྡན་པ་དང་། མྱ་ངན་ལས་འདས་པའི་ཆོས་དང་ལྡན་པ་ནི་མ་ཡིན་ནོ། །
en: They do not partake of a Dharma versed in the ultimate nor of a Dharma concerned with nirvāṇa.

source: ཀྱེ་རྒྱལ་བའི་བུ་དག་ཡང་དེ་བཞིན་གཤེགས་པ་དག་ལ་མི་མཁྱེན་པ་དང་། མི་གཟིགས་པའམ། མི་གསན་པ་དང་། རྣམ་པར་མི་མཁྱེན་པ་ཅུང་ཟད་ཀྱང་མི་མངའ་སྟེ།
en: “Sons of the Victorious One, there is indeed nothing whatsoever that the tathāgatas do not know, see, hear, or fully comprehend.

source: འོངས་པ་ཡང་མཁྱེན།
en: They know what has happened.

source: མ་འོངས་པ་ཡང་མཁྱེན།
en: They know the future.

source: འདས་པ་ཡང་མཁྱེན།
en: They know the past.

source: ད་ལྟར་བྱུང་བ་ཡང་མཁྱེན།
en: They know the present.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་ཡང་མཁྱེན།
en: They know the activities of all beings.

source: སྤྱོད་པ་ཡང་མཁྱེན།
en: They know their conduct.

source: ཁམས་ཀྱང་མཁྱེན།
en: They know their dispositions.

source: སྐྱེ་བ་ཡང་མཁྱེན།
en: They know their birth.

source: འབྱུང་བ་ཡང་མཁྱེན་ཏོ། །
en: They know their existence.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལྟ་སྟེ།
en: “Sons of the Victorious One, it is as follows.

source: དཔེར་ན་སྨན་པ་ལེགས་པར་བསླབས་པ། ཚེའི་རིག་པ་ཡན་ལག་བརྒྱད་པ་ཐམས་ཅད་ལ་ཆེས་མཁས་ཤིང་། ཁམས་ཐམས་ཅད་ལ་མཁས་པ། སྨན་དང་ཡོ་བྱད་སྦྱོར་བ་ལ་བརྩོན་པ་ནི་སེམས་ཅན་ནད་པ་ནད་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་བ་རྣམས་ཀྱི་ཁམས་ཀྱང་ཤེས།
en: Consider the analogy of a well-trained doctor who is very skilled in the eight branches of Āyurveda and expert in all conditions, having extensively studied the use of medicinal substances and instruments, and who knows the condition of the sick beings whose bodies are tormented by various ailments.

source: དུས་ཀྱང་ཤེས།
en: He knows the phases [and the degrees].

source: ཚོད་ཀྱང་ཤེས།
en: He knows [the phases and] the degrees.

source: སྨན་ཡང་ཤེས།
en: He knows the cure.

source: རླུང་ལས་གྱུར་པ་དང་། མཁྲིས་པ་ལས་གྱུར་པ་དང་། བད་ཀན་ལས་གྱུར་པ་དང་། འདུས་པ་ལས་གྱུར་པ་དང་། ཁྲག་ལས་གྱུར་པ་དང་། མ་ཞུ་བ་ལས་གྱུར་པ་དང་། སྐྲན་དང་། དམུ་རྫིང་དང་། སྙིང་ནད་དང་། མཛེ་དང་། གཡན་པ་དང་། ཤུ་བ་དང་། འབྲས་ལ་སོགས་པ་དང་དུག་དང་མེ་དབལ་ལ་སོགས་པ་ཡང་ཤེས་སོ། །
en: He knows the diseases related to the airs, bile, phlegm, or a combination of the three, and those related to blood, indigestion, tumors, edema, heart disease, leprosy, skin eruption, abscesses, and boils, as well as poisoning, inflammation, and so on.

source: དེས་ཐམས་ཅད་ཤེས་ནས་
en: Possessing knowledge of all these things,
